bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_sec_eng.c
        /* Set data source address */
        *(uint32_t *)(uintptr_t)(md5Ctx->linkAddr + 4) = (uint32_t)(uintptr_t)md5Ctx->md5Buf;

        /* Set data length */
        *((uint16_t *)(uintptr_t)md5Ctx->linkAddr + 1) = 1;

        /* Trigger */
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
        BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_TRIG_1T));

        /* Choose accumulating last hash in the next time */
        *((uint32_t *)(uintptr_t)md5Ctx->linkAddr) |= 0x40;
        input += fill;
        len -= fill;
        left = 0;
    }

    fill = len / 64;
    len = len % 64;

    if (fill > 0) {
        /* Wait finished */
        timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

        do {
            tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
            timeoutCnt--;

            if (timeoutCnt == 0) {
                return TIMEOUT;
            }
        } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

        /* Fill data */
        *(uint32_t *)(uintptr_t)(md5Ctx->linkAddr + 4) = (uint32_t)(uintptr_t)input;
        *((uint16_t *)(uintptr_t)md5Ctx->linkAddr + 1) = fill;

        /* Trigger */
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
        BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_TRIG_1T));

        input += (fill * 64);
        /* Choose accumulating last hash in the next time */
        *((uint32_t *)(uintptr_t)md5Ctx->linkAddr) |= 0x40;
    }

    if (len > 0) {
        /* Wait finished */
        timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

        do {
            tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
            timeoutCnt--;

            if (timeoutCnt == 0) {
                return TIMEOUT;
            }
        } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

        /* Copy left data into temp buffer */
        ARCH_MemCpy_Fast((void *)((uint8_t *)md5Ctx->md5Buf + left), input, len);
    }

    /* Wait finished */
    timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    do {
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  CRC16 link mode work input data function
 *
 * @param  shaNo: SHA ID type
 * @param  linkAddr: CRC16 link mode address
 * @param  input: CRC16 input data pointer, and the address should be word align
 * @param  len: CRC16 input data length
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_CRC16_Link_Work(SEC_ENG_SHA_ID_Type shaNo, uint32_t linkAddr, const uint8_t *in, uint32_t len, uint8_t *out)
{
    uint32_t SHAx = SEC_ENG_BASE;
    uint32_t tmpVal;
    uint32_t timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_AES_ID_TYPE(shaNo));

    /* Link address should word align */
    if ((linkAddr & 0x03) != 0) {
        return ERROR;
    }

    do {
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

    /* Set link address */
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_LINK, linkAddr);

    /* Change source buffer address and destination buffer address */
    *(uint32_t *)(uintptr_t)(linkAddr + 4) = (uint32_t)(uintptr_t)in;

    /* Set data length, 16 bits per block */
    *((uint16_t *)(uintptr_t)linkAddr + 1) = len * 8 / 16;

    /* Trigger */
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_TRIG_1T));

    /* Wait finished */
    timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    do {
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

    /* CRC16 code len is 16 bits */
    ARCH_MemCpy_Fast(out, (uint8_t *)(uintptr_t)(linkAddr + 0x10), 2);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  CRC32 link mode work input data function
 *
 * @param  shaNo: SHA ID type
 * @param  linkAddr: CRC32 link mode address
 * @param  input: CRC32 input data pointer, and the address should be word align
 * @param  len: CRC32 input data length
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_CRC32_Link_Work(SEC_ENG_SHA_ID_Type shaNo, uint32_t linkAddr, const uint8_t *in, uint32_t len, uint8_t *out)
{
    uint32_t SHAx = SEC_ENG_BASE;
    uint32_t tmpVal;
    uint32_t timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_AES_ID_TYPE(shaNo));

    /* Link address should word align */
    if ((linkAddr & 0x03) != 0) {
        return ERROR;
    }

    do {
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

    /* Set link address */
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_LINK, linkAddr);

    /* Change source buffer address and destination buffer address */
    *(uint32_t *)(uintptr_t)(linkAddr + 4) = (uint32_t)(uintptr_t)in;

    /* Set data length , 32 bits per block*/
    *((uint16_t *)(uintptr_t)linkAddr + 1) = len * 8 / 32;

    /* Trigger */
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_TRIG_1T));

    /* Wait finished */
    timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    do {
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

