bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_sec_eng.c
            if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_AES_0_INT)) {
                status = SET;
            }

            break;

        case SEC_ENG_INT_SHA:
            tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_SHA_0_CTRL);

            if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_INT)) {
                status = SET;
            }

            break;

        case SEC_ENG_INT_TRNG:
            tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_0);

            if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_TRNG_0_INT)) {
                status = SET;
            }

            break;

        case SEC_ENG_INT_PKA:
            tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_PKA_0_CTRL_0);

            if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_PKA_0_INT)) {
                status = SET;
            }

            break;

        case SEC_ENG_INT_CDET:
            break;

        case SEC_ENG_INT_GMAC:
            tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_GMAC_0_CTRL_0);

            if (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_GMAC_0_INT)) {
                status = SET;
            }

            break;

        default:
            break;
    }

    return status;
}

#ifndef BFLB_USE_HAL_DRIVER
/****************************************************************************/ /**
 * @brief  Sec Eng Trng IRQ Handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SEC_TRNG_IRQHandler(void)
{
    SEC_Eng_IntHandler(SEC_ENG_INT_TRNG);
}

/****************************************************************************/ /**
 * @brief  Sec Eng Pka IRQ Handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SEC_PKA_IRQHandler(void)
{
    SEC_Eng_IntHandler(SEC_ENG_INT_PKA);
}

/****************************************************************************/ /**
 * @brief  Sec Eng Aes IRQ Handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SEC_AES_IRQHandler(void)
{
    SEC_Eng_IntHandler(SEC_ENG_INT_AES);
}

/****************************************************************************/ /**
 * @brief  Sec Eng Sha IRQ Handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SEC_SHA_IRQHandler(void)
{
    SEC_Eng_IntHandler(SEC_ENG_INT_SHA);
}

/****************************************************************************/ /**
 * @brief  Sec Eng Cdet IRQ Handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SEC_CDET_IRQHandler(void)
{
    SEC_Eng_IntHandler(SEC_ENG_INT_CDET);
}

/****************************************************************************/ /**
 * @brief  Sec Eng Gmac IRQ Handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SEC_GMAC_IRQHandler(void)
{
    SEC_Eng_IntHandler(SEC_ENG_INT_GMAC);
}
#endif

/****************************************************************************/ /**
 * @brief  turn on sec ring
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void ATTR_TCM_SECTION SEC_Eng_Turn_On_Sec_Ring(void)
{
    uint32_t tmpVal = 0;

    /* Turn-on Sec Ring Oscillation */
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_3);
    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_ROSC_EN);
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_3, tmpVal);
}

/****************************************************************************/ /**
 * @brief  turn off sec ring
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void ATTR_TCM_SECTION SEC_Eng_Turn_Off_Sec_Ring(void)
{
    uint32_t tmpVal = 0;

    /* Turn-off Sec Ring Oscillation */
    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_3);
    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_TRNG_0_ROSC_EN);
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_TRNG_0_CTRL_3, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Group0 request access for CDET
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_Group0_Request_CDET_Access(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_CTRL_PROT_RD);

    if (((tmpVal >> 8) & 0x03) == 0x03) {
        /* CDET control idle, write to request*/
        BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_PROT, 0x02);

        /* Check request result */
        tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_CTRL_PROT_RD);

        if (((tmpVal >> 8) & 0x03) == 0x01) {
            return SUCCESS;
        }
    }

    return ERROR;
}

/****************************************************************************/ /**
 * @brief  Group0 release CDET Access
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_Group0_Release_CDET_Access(void)
{
    /* CDET control idle, write to request*/
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_PROT, 0x06);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Group1 request CDET Access
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_Group1_Request_CDET_Access(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_CTRL_PROT_RD);

    if (((tmpVal >> 8) & 0x03) == 0x03) {
        /* SHA control idle, write to request*/
        BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_PROT, 0x04);

        /* Check request result */
        tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_CTRL_PROT_RD);

        if (((tmpVal >> 8) & 0x03) == 0x02) {
            return SUCCESS;
        }
    }

