bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_sec_eng.c
    return ERROR;
}

/****************************************************************************/ /**
 * @brief  Group1 release CDET Access
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_Group1_Release_CDET_Access(void)
{
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_PROT, 0x06);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Init CDET module
 *
 * @param  xtalNum: Loop times
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_CDET_Init(uint16_t xtalNum)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_0);
    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_CDET_0_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_CDET_0_MODE);
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_0, tmpVal);

    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_1, 0x0000FFFF);

    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_CDET_0_T_LOOP_N, xtalNum - 1);
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_2, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Start CDET module
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_CDET_Start(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_CDET_0_EN);
    BL_WR_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_0, tmpVal);

    while (1) {
        tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_0);
        tmpVal = BL_GET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_CDET_0_BUSY);
        if (tmpVal) {
            break;
        } else {

        }
    }
}

/****************************************************************************/ /**
 * @brief  Get XTAL frequency after cdet module not busy
 *
 * @param  None
 *
 * @return XTAL frequency(unit: hz)
 *
*******************************************************************************/
uint32_t Sec_Eng_CDET_GetXtalFreq(void)
{
    uint32_t tmpVal = 0;
    uint64_t xtalNum, rcNum;

    while (1) {
        tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_0);
        tmpVal = BL_GET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_CDET_0_BUSY);
        if (tmpVal) {

        } else {
            break;
        }
    }

    tmpVal = BL_RD_REG(SEC_ENG_BASE, SEC_ENG_SE_CDET_0_CTRL_3);
    xtalNum = tmpVal & 0xFFFF;
    rcNum = (tmpVal >> 16) & 0xFFFF;

    return (uint32_t)((32000000 * xtalNum +  rcNum / 2)/ rcNum);
}

/*@} end of group SEC_ENG_Public_Functions */

/*@} end of group SEC_ENG */

/*@} end of group BL808_Peripheral_Driver */
